zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_PCI_HDR_TYPE0.h
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK (0x8U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT (3U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_PF_MEM_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_MASK (0xFFFFFFF0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT (4U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_WIDTH (28U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR(x)   (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR1_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR2 - PCI base address register 2 */
/*! @{ */

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK (0x1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT (0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_IO_IND_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK (0x6U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_WIDTH (2U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_MEM_TYPE_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK (0x8U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT (3U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_PF_MEM_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_MASK (0xFFFFFFF0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT (4U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_WIDTH (28U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR(x)   (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR2_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR3 - PCI base address register 3 */
/*! @{ */

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK (0x1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT (0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_IO_IND_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK (0x6U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_WIDTH (2U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_MEM_TYPE_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK (0x8U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT (3U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_PF_MEM_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_MASK (0xFFFFFFF0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_SHIFT (4U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_WIDTH (28U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR(x)   (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR3_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR4 - PCI base address register 4 */
/*! @{ */

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_MASK (0x1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_SHIFT (0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_IO_IND_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_MASK (0x6U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_SHIFT (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_WIDTH (2U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_MEM_TYPE_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_MASK (0x8U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_SHIFT (3U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_PF_MEM_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_MASK (0xFFFFFFF0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_SHIFT (4U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_WIDTH (28U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR(x)   (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR4_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR5 - PCI base address register 5 */
/*! @{ */

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_MASK (0x1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_SHIFT (0U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_IO_IND_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_MASK (0x6U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_SHIFT (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_WIDTH (2U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_MEM_TYPE_MASK)

#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_MASK (0x8U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_SHIFT (3U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_WIDTH (1U)
#define TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_SHIFT)) & TMR_PCI_HDR_TYPE0_PCI_CFH_BAR5_PF_MEM_MASK)

